
# 1.
# Выводить
# результат
# в
# виде
# шкалы:
# Пример: Если
# результат
# 30
# 20 = = = = = = |= = = = = = = = = = = =50
#
# Если
# 40
# 20 == == == == == == |= == == =50

# hight = float(input('Введите рост: '))
# weight = int(input('Ведите вес: '))

# hight = 1.7
# weight = 80
#
# imb = weight/hight**2
# print('Ваш индекс массы тела: ', imb)
#
# min_scale = 20
# max_scale = 50
#
# len_1 = imb - min_scale
# len_2 = max_scale - imb
#
# print(round(len_1))
# print(round(len_2))


b = ['20', '=', '=', '=', '=', '=', '=', '=', '=', '=', '=', '=', '=', '=', '=', '=', '=', '=', '=', '=', '=', '=', '=',
     '=', '=', '=', '=', '=', '=', '=', '50']
c = b[3] = '|'
print(c)
print(''.join(b))
