#Целые числа
int
1, 2, 3, 4, -1, -2

#Числа с точкой плавающей или дробные
float
2.3, 4.8, 3.14

#Cтроки заключаются в кавычки двойные, либо одинарные
'Hello World'

#Списки содержат в себе различные типы данных
list
[1, 3.14, 'Hello']

#Словари - список пар - 'Ключ - значение'
dict
{'Nick' : '123', 'Anna' : '321'}

#Кортежи - последовательность неизменяемых объектов
tuple
(1, 3.14, 'Hello')

#Множество - последовательность уникальных объектов - (Дубликатов быт не может)
set
{'a', 'b', 'c'}

#Булевые значения  - True or False - (Созданы для ветвления логики)
bool
True
False

#Замена определенных типов данных
x = 1
print(x)
print(type(x))
x = float(x)
print(x)


